# Pandas Series

A series is a 1-D labeled array capable of holding any data type. The axis labels are collectively called the index.

# Creating series
There are multiple ways to create series

In [121]:
import numpy as np
import pandas as pd

In [123]:
labels=['a', 'b', 'c']
my_list=[10,20,30]
arr = np.array([10,20,30])
d={1:10,2:20,3:30}

In [125]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [127]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [129]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [131]:
pd.Series(d)

1    10
2    20
3    30
dtype: int64

# Data Frame
When you combine multiple series together, then it become data frame.

# Creating a Dataframe

In [135]:
data={
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28,34,29,42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary':[65000,70000,62000,85000]
}

In [137]:
df=pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [138]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2=pd.DataFrame(data_list)
Header = ['Name', 'age', 'city', 'salary']
df2=pd.DataFrame(data_list,columns=Header)
df2

    Name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

# Selection and Indexing of Columns

In [142]:
df2[['Name','city']]

    Name      city
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

# Creating a new column

In [144]:
df2["Designation"]=["Doctor", "Engineer", "Doctor", "Engineer"]
df2

    Name  age      city  salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000    Engineer

# Remove a column

In [ ]:
df2.drop('Designation')
df2

In [ ]:
df2.drop('Designation', axis=1)

In [ ]:
df2

In [ ]:
df2.drop('Designation', axis=1, inplace=True)

In [ ]:
df2

In [ ]:
df2.drop(['city', 'salary'], axis=1)

In [ ]:
df2

In [ ]:
df2.drop(0, axis=0)

# Selecting a Row

In [ ]:
df2

In [ ]:
df2[0]

In [ ]:
df2.loc[0]

In [ ]:
df2.loc[[0,1]]

In [ ]:
df.iloc[3]

# Selecting Subsets of Rows and Columns

In [ ]:
df2

In [ ]:
df.loc[[0,1]][["City","Salary"]]

In [ ]:
df2.loc[[2,3]][["city", "salary"]]

# Conditional Selection

In [ ]:
df2

In [ ]:
# I only want to see those people whose age is above 30

In [ ]:
df2["age"] >30

In [ ]:
df2[df2["age"] >30]

In [ ]:
#I only want poeple whose age is above 30 and their city must be paris

In [ ]:
df2[(df2["age"] >30) & (df2["city"]== 'Paris')]

# Finding Missing Data

In [ ]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
df.isna()

In [ ]:
df.isna().sum()

In [ ]:
df.isna().any()

# Removing Missing Data

In [ ]:
df

In [ ]:
df.dropna()

In [ ]:
df

In [ ]:
df.dropna(thresh=3)

In [ ]:
df

In [ ]:
df.dropna(thresh=4)

# Filling the missing Data

In [ ]:
df

In [ ]:
df.fillna(0)

In [ ]:
values = {'A':0,'B':100,"C":300,'D':400}
df.fillna(value=values)

In [ ]:
df.fillna(df.mean())

# Merging 2 dataframes

In [ ]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

# DataFrame 2: Salary information
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [ ]:
employees

In [ ]:
salaries

In [ ]:
pd.merge(employees,salaries,on='employee_id',how ='inner')

In [ ]:
pd.merge(employees,salaries,on='employee_id',how ='outer')

In [ ]:
pd.merge(employees,salaries,on='employee_id',how ='left')

In [ ]:
pd.merge(employees,salaries,on='employee_id',how ='right')

# Concatenation of 2 dataframes

In [ ]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.concat([df1,df2])  #Column

In [ ]:
pd.concat([df1,df2], axis=1)  #Row

# Joining 2 data frames

In [ ]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
df2 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.join(df2,how='outer')

In [ ]:
df2.join(df1)

In [ ]:
df2.join(df1, how='outer')

# GroupBy & Aggregation

GroupBy

In [ ]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
# Group by Category and calculate the sum of Sales
# Note:- When we create a group-by its not create data, its create an object and we can't see the object.
cat = df.groupby('Category')['Sales'].sum()
cat

In [ ]:
# Group by Store and calculate the sum of Sales
cat1 = df.groupby('Store')['Sales'].sum()
cat1

In [ ]:
# Group by multiple columns
# Group by Category and Store
cat3 = df.groupby(['Category','Store'])['Sales'].sum()
cat3

# Aggregation

In [ ]:
df['Sales'].mean()

In [ ]:
df['Sales'].median()

In [ ]:
df['Sales'].max()

In [ ]:
df['Sales'].min()

In [ ]:
df['Sales'].count()

In [ ]:
df['Sales'].std()

In [ ]:
df['Sales'].agg(['sum', 'mean', 'min', 'max', 'count', 'std', 'median'])

# Pivot Tables

In [ ]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

In [ ]:
pd.pivot_table(df,values = "Sales",index = 'Region',columns="Product")

In [ ]:
pd.pivot_table(df,values = "Sales",index = 'Region',columns="Product",aggfunc = 'median')

In [ ]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

In [ ]:
pd.crosstab(df['Region'],df['Product'])

# DataFrames Basic Operations

In [84]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [86]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [88]:
df1.shape

(5, 3)

In [90]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [92]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [94]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [96]:
df1['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

In [98]:
df1.head()

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [100]:
df1.tail()

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

# DataFrames Applying Functions

In [103]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [107]:
def square(x):
    return x**2

In [109]:
df1['B'].apply(square)

0     100
1     400
2     900
3    1600
4    2500
Name: B, dtype: int64

In [111]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [113]:
df1['D']= df1['B'].apply(square)

In [115]:
df1

   A   B    C     D
0  1  10  100   100
1  2  20  200   400
2  3  30  300   900
3  4  40  400  1600
4  5  50  500  2500

In [117]:
df1['D']= df1['B'].apply(lambda x : x**2)

In [119]:
df1

   A   B    C     D
0  1  10  100   100
1  2  20  200   400
2  3  30  300   900
3  4  40  400  1600
4  5  50  500  2500